function getRandomInt(max) {
  return Math.floor(Math.random() * max);
}

const targetEntities = {
    "dummmmmmy:target_dummy":["还不够！", "来锻炼吧！", "很好，来，继续！"],
    "minecraft:cat":["哈！", "喵嗷！", "喵呜呜呜", "我哈气了！"],
    "undergarden:rotling":["腐...败..", "加入我们吧...."],
    "undergarden:scintling":["滋滋"],
    "undergarden:forgotten":["你...知道主人去哪了吗....", "这里好冷..."],
    "divinerpg:pumpkin_spider":["我不好吃！", "你说我是吃南瓜吃的？得了兄弟", "我的兄弟是洞穴蜘蛛！"],
    "divinerpg:cyclops":["我看着你", "在北方有我的大哥", "你是不是在跟我说话？", "呃啊"],
    "minecraft:guardian":["我喜欢海洋", "人类，你去过南方吗", "赶紧滚开这里", "我才不会告诉你这里有金子，这是我们的宝藏", "你真的会游泳吗"],
    "aquamirae:golden_moth":["闪闪发光的东西！", "我喜欢金子！", "你是来给我金子的？"],
    "aquamirae:maw":["人类，你看起来很浩赤", "让我尝尝你吧", "你绝对想不到在中心会有什么", "哈！！"],
    "aquamirae:maze_mother":["我塑造了这个地方，美丽吗", "这就是我的一切...", "或许有一天，我也能展翅飞翔"],
    "aquamirae:anglerfish":["你逃不出这个地方的", "你在找什么？死去的灵魂们吗？", "他们都被我吃了"],
    "goety:wraith":["献上你的灵魂", "还是我自己来拿，你的灵魂", "成为和我一样的存在吧"],
    "minecraft:strider":["带我去看世界吧"],
    "divinerpg:kobblin":["我厌恶别人把我踩在地上的感觉", "来吧，让我把你拖进土里", "别动！小伙子！"],
    "divinerpg:enthralled_dramcryx":["看看我漂亮的牙齿", "看看我漂亮的后背！", "看看我！", "上面不好，我一直在地下生存"],
    "cataclysm:deepling_angler":["给我过来吧你", "你知道二十年前的事吗", "我见过巨大的火光"],
    "cataclysm:deepling":["让我刺穿你的身体", "尝尝你的心脏！", "为了伟大的斯库拉大人！"],
    "minecraft:zombie":["嗷呜...", "脑子...", "我确实不喜欢植物", "你是不是在跟我说话？", "你在砍掉我的手臂吗", "我之前好像也为谁战斗过...", "什么导"],
    "minecraft:creeper":["嘶嘶", "我要爆炸了！！！", "真得收拾你了", "你说林芝是谁？我没听说过"],
    "minecraft:skeleton":["咔嚓咔嚓", "你敢打我？", "哈哈，我以前也是个人类，但我现在需要你的生命", "我讨厌蜘蛛", "你去过暮色吗", "千万别给先导干活！"],
    "minecraft:spider":["你知道骷髅吗，我很想它", "我很怀念和骷髅的时光", "它以前总骑着我兜风", "那场大战带走了一切"],
    "minecraft:stray":["感受这冰天雪地吧", "我喜欢雪", "冻“骨头”了吧", "枝柏市的天气很好"],
    "goety:web_spider":["我的兄弟是南瓜蜘蛛！", "我要酷酷射你身上！", "接下吧！！", "我要把你包起来！"],
    "minecraft:enderman":["你这家伙, 看到我的眼睛了是吧", "嗷啊啊啊啊啊", "那场战争之后，我们被迫搬到了终末之地", "我一定要杀了你！"],
    "minecraft:zombified_piglin":["咕噜咕噜", "金哼~~", "哈气！！"],
    "undergarden:rotbeast":["咆哮！！", "滚粗去！", "你想尝尝我的牙齿吗？", "我讨厌光！"],
    "undergarden:rotwalker":["呵呵", "咳咳", "嘎嘎"],
    "divinerpg:crab":["我不好吃", "夹你！"],
    "divinerpg:king_crab":["看看我这闪亮的大夹子吧，人类", "你最好不要惹怒我！", "我再也不想给斯库拉干活了", "好强的刀..."],
    "divinerpg:wildfire":["你想被社保了是吧", "别怪我没警告过你", "我的箭也未尝不利", "可恶的怒焰王..."],
    "infinite_abyss:charya":["这里好冷...好孤单...", "你知道我的家人去哪了吗...", "我想念他们...", "我会继续战斗...为了我的...", "我的国家在哪里...", "求你杀了我...让我回家...", "我是什么....", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么？", "你是不是在跟我说话？", "你在找什么?", "已经..."],
    "divinerpg:king_of_scorchers":["谁让你们来的", "居然是他...可恶啊", "你们这些人...他让你们送死的吗", "我劝你们离开这里！", "不走是吧, 别怪我了", "我会让们的灵魂升华，当然，是火化", "你们这些人类，真是愚蠢", "我会让你们知道，什么叫做真正的火焰！", "你们给他干活，也不会有什么好下场的", "流氓！流氓！！"],
    "cataclysm:netherite_monstrosity":["正在识别攻击目标", "目标已锁定", "消灭目标", "启动自我保护程序", "系统过热，正在冷却", "警告，警告，系统过热", "猪灵族万岁！", "我的使命是：打败先导，解放下界", "愚蠢的敌人们，不能阻碍我们的事业", "兹拉兹...", "启动背后隐藏能源！"],
    "goety:vizier":["蠢货们！接招！", "你们又能有什么能耐！", "你们这群混蛋！", "不是，快给我住手，我的宅邸！", "快去拦住他们！", "尝尝我的法术！", "好了别打了别打了！", "我给你们钱行吗，不要再打了", "欸哟喂！！"],
    "undergarden:forgotten_guardian":["别动，你们", "我会守护这里", "...直到国王回来", "滚出去！", "不许停留！", "我要把你们砸成肉酱！"],
    "infinite_abyss:crystal_construct":["咕咕", "嘎嘎", "血！"],
    "minecraft:wither":["我即是毁灭", "把你的灵魂交还于我", "我需要这个世界", "你无法阻止我", "我要毁灭这个世界！", "那些远古人类以为杀死了我，但是我永远不会死亡", "总有一天我还会回来", "在第一次大战中，下界还不是地狱，我还未出现", "要怪谁？", "这世界没有意义！"],
    "cataclysm:the_harbinger":["我不希望毁灭，但我会毁灭一切阻碍枝柏王国的敌人", "何以？我不会相信...", "消灭你们！", "跟我的导弹说去吧！", "我会把你们撕成碎片！"],
    "divinerpg:the_watcher":["我看到了这个世界，我也看到了，你", "地狱空荡荡，恶魔在人间", "就算把我囚禁住，我也会望穿千里", "我看到了未来，我会死", "我已然接受一切", "你也看看我的眼睛吧"],
    "divinerpg:sunstorm":["人类，你们的血液是最好的升级材料", "让我砍下你的头颅吧", "哈哈哈哈哈", "我们会像几百年前一样，我们会回来", "什么，不可能！", "就凭你？", "愚蠢的人类们，臣服我们吧"],
    "divinerpg:termasect":["看好了，你们才没有这么漂亮的树干", "让我插进你的身体吧，让我吸干你们的血吧", "旋转旋风劈！", "我要主宰你们！"],
    "aether:slider":["嘻嘻，我要撞扁你口牙", "什么，你有镐子！", "我超硬的！", "来试试碰撞吧！", "这招怎么样，哎哟！"],
    "minecraft:warden":["那些人们，他们会回来的...", "我真得对你哈气了", "烦人的小生物", "我会一直守护这里", "你一定长得不好看！", "哈！！！！", "重拳出击！", "我的心脏..."],
    "divinerpg:ancient_entity":["我又回来了，熟悉的世界", "我会再次统治这里", "我要把这里变成焦土，焦土使我舒服", "弱小的人类，弱小的怪物"],
    "goety:crone":["...", "去死吧", "我没办法", "我真的没办法！", "唉...."],
    "goety:wight":["灵魂...搱鍩....", "给我..", "嘻嘻嘻嘻", "哈哈哈哈", "浣犲湪璇翠粈涔堝憿", "鍝堝熀绫冲搱鍩虹背鍝堝熀绫�", "杩欏緢妫�", "缁濅匠鐨勫疄楠屾潗鏂�", "鐪嬬潃鎴戠殑鐪�"],
    "twilightforest:minoshroom":["卡利克斯，死了么，真是感到惋惜", "也好，我们又多一片土地", "好吧，我得先杀掉你了", "你为什么要直接啃我", "我不是蘑菇", "呃啊", "看看我靓丽的斧头", "呵呵呵哈哈哈"],
    "minecraft:ender_dragon":["我是末地的领主", "你打扰到我了", "闪电会惩罚你", "你无法击溃我！", "那些眼睛吗，它们才不会帮你", "你再打一下试试？", "耦，我的水晶！那些可是我的至宝", "我不会饶了你！"],
    "infinite_abyss:frozen_wither":["我会毁灭一切，但是以冰雪的方式", "凋灵，我们的使命，便是熵减，寒冰毅然如此", "我会让你永远消失","我会把你冰封起来，变成好看的雕塑", "哈哈哈，感受冰雹的炸裂"],
    "cataclysm:ignis":["自从来到这里之后，我就知道没有任何前途了", "现在你们又要来夺走我的生命", "我手上的正义之剑，会作出回答！", "先导？那也是个可怜的老家伙", "尽管如此，我也不会把这个交给你们", "快燃尽了...", "不过，除非你们打败我，来让这把剑认可你们....", "....否则，我不会让你们得逞的！", "希望你们能够改变这一切", "这悲惨的命运！"],
    "cataclysm:scylla":["难道我们就不能坐下来谈生意吗", "我都不知道你们怎么想的", "欸我真是服了", "你们这些人，真是愚蠢", "那我就来终结你们的狗命吧！", "说什么我背叛了你们，明明你们才是那个背叛我的", "潮水啊，赐予我力量！", "我会让你们知道，什么叫做真正的海洋之怒！", "真是命运不公", "sorry，我不想再见到你们了", "利维坦，我的利维坦呢！", "真是可恶"],

    "aquamirae:captain_cornelia":["...", "遵从主人的命令...", "我...是谁...", "混乱, 混乱, 无序", "H̴̤̻̞͍̗̦͈̬͈̎̃̐́͛̽́̃̉͆͑̈́̈̀̿̇̀̾͠ẹ̶̻̖͎̩̥̤̺̮͚̠̳͚͖̙̄͂͒̆̏͑͂̾̇̓͝Ļ̵͍̖̟͈̲̇͐̒̆̂́̅͋̕͘p̵̢̹̬̫̳͉͙̜̙̲͕̝̍̋̌͆̕͜ ̶̢̛̖̤̦̞̻̘̩͇̲̥̹͔̍̆̓̈͊̑̎̀̈́͒̇̇̽̚͘͜͝͞M̴̺͖̩̖͕̜̍̚e̷̯̩̮͈͊́̐̑̌̃́́̈́̑͜͠͞͠͝", "K̸͉̳͓̊̂̏͂̑͋́̒̈́͜ĩ̸̭̬͖͙̳̪͑́̋̍̑̊̒͗̅̐̅̓͆̚͠͠L̶̢̡̫̳͙̙͍̬͖͕͑l̸̛̩̥̮̬̲͎̥̦̦͚̤͕̜̜̟͍̝͂̓́̋̍̋̅̓ͅ ̴͈͍̙͖͗̿̑̔̎̒̊́̊̊͛́͗̾͠͝͠͞M̴̢̤̜͙̮̻̬̯͍̜͍̪̝̗̻̏̌̓̐͗̊̄̌͜e̶̞͆̀̃͗͆̄͑̽̇̇͂̄͌̋̚͝͞", "我不想再做仆奴了...", "我的将士都在哪里", "求求你们，杀了我吧，我受不了了！", "我会杀了你们的", "我已经不是....", "希望在另一个世界，我也能驾驶大船航行远方..."],
    "cataclysm:the_leviathan":["嗷呜！！！", "哈！！！", "呃！！", "BIU！", "BOOm！"],
    "cataclysm:maledictus":["嚯嚯，有本事，你就再往前一步吧", "让我看看你都学到了什么", "没用没用没用！", "我可以放你一条生路，怎么样，回到我的身边", "看来你也不过如此", "你这么想，我就不信你能活到现在", "你好歹也是给我干过活的，难道我对你还不够好吗", "嚯嚯，继续吧", "就算你有那把武器，也不如我超强的治愈能力，我是无敌的！", "这就是我们..宿命间的对决", "我要了结这一切！", "拥有这些力量，再次改变这个世界，指日可待", "我会成为神", "我已经不做人了！", "嚯嚯，还想要试试吗，我劝你还是放弃吧", "怎么不逃跑啊，你以为你很有毅力吗", "又如何，又能怎？", "太慢了太慢了！", "尝尝我的战戟！", "怎么，你不服吗，看你都流多少血了", "不可能，你不可能能打败我！", "看好了，这才是真正的力量", "真是太蠢了，只有不断追求力量的人，才能存活于这世上", "为了这个世界，我做了这么多，结果你们就这样对我吗？！"]
}

// 监听实体受伤事件
EntityEvents.hurt(event => {
    if (event.source.actual && event.source.actual.isPlayer()) {
        let { entity, source} = event; // entity为受伤实体，source为伤害来源
        let player = source.actual; // 获取玩家实体
        let target_id = entity.getType(); // 获取目标实体id
        let targetName = entity.getDisplayName().getString(); // 获取目标实体名字
        let random_value = getRandomInt(10); // 随机获取0-10的整数
        
        if (random_value == 0){
            for(const [id, value] of Object.entries(targetEntities)){
                if(id == target_id){
                    let randomIndex = getRandomInt(value.length); // 随机获取一条回复
                    player.tell(targetName + "对你说：" + value[randomIndex])
                    break
                }
            }
        }
    }
})
